#include <stdio.h>

int main(void) {
    int n;
    printf("Введите число: ");
    scanf("%d", &n);
    
    int i = 1;
    int k = 1;
    while (k<=n) {
        printf("%d", i*i);
        i++;
        k++;
    }
    printf("\n");
    return 0;
}
//префиксный инкремент ++i сначала увеличивает на 1, потом использует значение.
//постфиксный инкремент i++ сначала использует текущее значение, затем увеличивает его на 1.
//То есть программа сразу прибавляет 1 к і (было 1, стало 2), и только потом считает квадрат.
//и получается вывод начинается с 4.
